## 시리즈 클래스

In [4]:
import pandas as pd

In [26]:
s = pd.Series([9904312, 3448738, 2890451, 2466052],
             index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448738
인천    2890451
대구    2466052
dtype: int64

In [4]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
s.values

array([9904312, 3448738, 2890451, 2466052], dtype=int64)

In [8]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448738
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [9]:
s / 1000000

도시
서울    9.904312
부산    3.448738
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [10]:
s[1], s['부산']

(3448738, 3448738)

In [11]:
s[3], s['대구']

(2466052, 2466052)

In [12]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448738
Name: 인구, dtype: int64

In [13]:
s[['서울', '대구', '부산']]

도시
서울    9904312
대구    2466052
부산    3448738
Name: 인구, dtype: int64

In [14]:
s[(250e4 < s ) & (s < 500e4)] #인구가 250만 초과, 500만 미만인 경우

도시
부산    3448738
인천    2890451
Name: 인구, dtype: int64

In [18]:
s[1:3]                 #두번째(1)부처 세번째(2)까지 (네번째(3) 미포함)

도시
부산    3448738
인천    2890451
Name: 인구, dtype: int64

In [19]:
s["부산":"대구"]      # 부산에서 대구까지 (대구도 포함)

도시
부산    3448738
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [22]:
s0 = pd.Series(range(3), index=['a', 'b', 'c'])
s0

a    0
b    1
c    2
dtype: int64

In [23]:
s0.a

0

In [24]:
s0.b

1

In [37]:
s = pd.Series([9904312, 3448738, 2890451, 2466052],
             index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448738
인천    2890451
대구    2466052
dtype: int64

In [42]:
'서울' in s            # 인덱스 라벨 중에 서울이 있는가

True

In [43]:
'대전' in s            # 인덱스 라벨 중에 대전이 있는가

False

In [44]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448738
인천 = 2890451
대구 = 2466052

In [45]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [46]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [47]:
ds = s- s2
ds

대구         NaN
대전         NaN
부산     55547.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
s.values - s2.values

array([ 6511121, -6182744,   258416,   975894], dtype=int64)

In [49]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [50]:
ds[ds.notnull()]

부산     55547.0
서울    272830.0
인천    258416.0
dtype: float64

In [51]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.637014
서울    2.832690
인천    9.818107
dtype: float64

In [52]:
rs['부산'] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [54]:
rs['대구'] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [55]:
del rs['서울']
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

## 데이터프레임 클래스

1. 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비한다.

2. 이 각각의 열에 대한 이름(라벨)을 키로 가지는 딕셔너리를 만든다.

3. 이 데이터를 DataFrame 클래스 생성자에 넣는다. 
   동시에 열방향 인덱스는 columns 인수로, 행방향 인덱스는 index 인수로 지정한다.

In [15]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ['지역', '2015', '2010', '2005', '2000',"2010-2015 증가율" ]
index = ['서울', '부산', '인천', '대구']
df = pd.DataFrame(data, index=index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [16]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [17]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [18]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [19]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [20]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [21]:
# "2010-2015 증가율" 이라는 이름의 열 추가
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [22]:
#"2010-2015 증가율"이라는 이름의 열 삭제 
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [23]:
# 하나의 열만 인덱싱하면 시리즈가 반환된다. 
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [24]:
# 여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다. 
df[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [25]:
# 2010이라는 열을 반환바면서 데이터프레임 자료형을 유지 
df[['2010']]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [26]:
type(df[['2010']])

pandas.core.frame.DataFrame

In [27]:
#2010이라는 열을 반환하면서 시리즈 자료형으로 반환
df['2010']

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [30]:
type(df['2010'])

pandas.core.series.Series

In [31]:
df[0]

KeyError: 0

In [33]:
import numpy as np

In [35]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [36]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [37]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [38]:
df[:1]

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972

In [39]:
df[1:2]

특성   지역     2015     2010     2005     2000
도시
부산  경상권  3448737  3393191  3512547  3655437

In [40]:
df[1:3]

특성   지역     2015     2010     2005     2000
도시
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338

In [41]:
df['서울':'부산']

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437

In [42]:
df["2015"]['서울']

9904312